perf_test/results/20251225_103242/offers_list_report.txt
Requests      [total, rate, throughput]  2000, 100.05, 15.54
Duration      [total, attack, wait]      49.9918455s, 19.99061375s, 30.00123175s
Latencies     [mean, 50, 95, 99, max]    24.272800167s, 30.000339766s, 30.001214751s, 30.00140646s, 30.006737625s
Bytes In      [total, mean]              7836494, 3918.25
Bytes Out     [total, mean]              0, 0.00
Success       [ratio]                    38.85%
Status Codes  [code:count]               0:1223  200:777  
Error Set:
Get "http://localhost:8080/api/v1/offers": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8080/api/v1/offers?offer_type=rent&property_type=house": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8080/api/v1/offers?offer_type=sale": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8080/api/v1/offers?offer_type=sale&property_type=apartment": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Get "http://localhost:8080/api/v1/offers?offer_type=sale&property_type=apartment&rooms=2": context deadline exceeded (Client.Timeout exceeded while awaiting headers)