perf_test/results/20251225_103242/offers_single_report.txt
Requests      [total, rate, throughput]  2000, 100.05, 99.99
Duration      [total, attack, wait]      20.002471375s, 19.989770625s, 12.70075ms
Latencies     [mean, 50, 95, 99, max]    13.704762ms, 13.386087ms, 15.300109ms, 21.11174ms, 30.938125ms
Bytes In      [total, mean]              2070800, 1035.40
Bytes Out     [total, mean]              0, 0.00
Success       [ratio]                    100.00%
Status Codes  [code:count]               200:2000  
Error Set: